In [1]:
# This project involves using Beautiful Soup to extract information relating to Oscar winners from Wikipedia pages. 
# In total six different pages will be accessed in order to obtain the following:
# 1. Best Picture 
# 2. Best Director
# 3. Best Actor
# 4. Best Actress
# 5. Best Supporting Actor
# 6. Best Supporting Actress
# Once the data has been retrieved from each page, it will be stored in dataframes. 
# I will then connect to MySQL, create tables and insert the data there. 
# Finally I will run queries on the database to provide useful insight.

In [2]:
# Import functions from file
from functions import loadPage, extractYears, extractFilmData 
# Pandas for creating dataframes
import pandas as pd

In [3]:
# Page 1- Best Picture
# Call function to read in URL and retrieve data from the page
data = loadPage("https://en.wikipedia.org/wiki/Academy_Award_for_Best_Picture")
# From the data get all the tables that have the following class
tables = data.findAll("table", class_= "wikitable")

In [4]:
# Call function to get the film data from tables
data = extractFilmData("picture", tables)
# Create lists from the dictionary columns
films = data["films"]
producers = data["names"]
# Call function to get a list of years from tables
years = extractYears("picture", tables)

In [5]:
# Check the length of each list. They are all the same length.
print("Years:      %d" % (len(years)))
print("Producers:  %d" % (len(producers)))
print("Films:      %d" % (len(films)))

Years:      92
Producers:  92
Films:      92

In [6]:
# Create a data frame for storing each Best Picture Winner
df_picture = pd.DataFrame()
df_picture["Year"] = pd.to_numeric(years, errors='coerce')
df_picture["Film"] = films
df_picture["Producers"] = producers

In [7]:
# Show the first 5 rows of dataframe
df_picture.head()

   Year                            Film               Producers
0  1928                           Wings  Paramount Famous Lasky
1  1929             The Broadway Melody     Metro-Goldwyn-Mayer
2  1930  All Quiet on the Western Front               Universal
3  1931                        Cimarron               RKO Radio
4  1932                     Grand Hotel     Metro-Goldwyn-Mayer

In [8]:
# Show the last 5 rows of the dataframe
df_picture.tail()

,Year,Film,Producers
87,2015,Spotlight,"Blye Pagon Faust, Steve Golin, Nicole Rocklin,..."
88,2016,Moonlight,"Adele Romanski, Dede Gardner, and Jeremy Kleiner"
89,2017,The Shape of Water,Guillermo del Toro and J. Miles Dale
90,2018,Green Book,"Jim Burke, Charles B. Wessler, Brian Currie, P..."
91,2019,Parasite,Kwak Sin-ae and Bong Joon-ho

In [9]:
# Page2 - Best Director
data = loadPage("https://en.wikipedia.org/wiki/Academy_Award_for_Best_Director")
tables = data.findAll("table", class_= "wikitable sortable")

In [10]:
data = extractFilmData("director", tables)
films = data["films"]
directors = data["names"]
years = extractYears("director", tables)

In [11]:
# Check the length of each list. 
# They are not the same length because the 1st Oscars had multiple awards in the same category
print("Years:      %d" % (len(years)))
print("Directors:  %d" % (len(directors)))
print("Films:      %d" % (len(films)))

Years:      92
Directors:  93
Films:      93

In [12]:
# To amend this lets insert a year at index 1 with the same value as the year at index 0
years.insert(1, years[0])

In [13]:
# Now they are all the same length
print("Years:      %d" % (len(years)))
print("Directors:  %d" % (len(directors)))
print("Films:      %d" % (len(films)))

Years:      93
Directors:  93
Films:      93

In [14]:
df_directors = pd.DataFrame()
df_directors["Year"] = pd.to_numeric(years, errors='coerce')
df_directors["Director"] = directors
df_directors["Film"] = films

In [15]:
# See the first two rows have the same year.
df_directors.head()

   Year                          Director                            Film
0  1928  Frank Borzage (Dramatic Picture)                      7th Heaven
1  1928  Lewis Milestone (Comedy Picture)             Two Arabian Knights
2  1929                       Frank Lloyd                 The Divine Lady
3  1930                   Lewis Milestone  All Quiet on the Western Front
4  1931                     Norman Taurog                          Skippy

In [16]:
df_directors.tail()

    Year               Director                Film
88  2015  Alejandro G. Iñárritu        The Revenant
89  2016        Damien Chazelle          La La Land
90  2017     Guillermo del Toro  The Shape of Water
91  2018         Alfonso Cuarón                Roma
92  2019           Bong Joon-ho            Parasite

In [17]:
# Page 3- Best Actor
data = loadPage("https://en.wikipedia.org/wiki/Academy_Award_for_Best_Actor")
tables = data.findAll("table", class_= "wikitable sortable")

In [18]:
data = extractFilmData("actor", tables)
films = data["films"]
actors = data["names"]
years = extractYears("actor", tables)

In [19]:
# Check the length of each list. 
# They are not the same length. There are two reasons for this.
# 1. In the 1st Oscars ceremony, the actor won awards for two films
# 2. In 1932 there was a tie for 1st place
print("Years:   %d" % (len(years)))
print("Actors:  %d" % (len(actors)))
print("Films:   %d" % (len(films)))

Years:   92
Actors:  93
Films:   94

In [20]:
# To amend this lets insert the actor at position 0 into position 1 and insert the appropriate years at position 1 and 6 of years
actors.insert(1, actors[0])
years.insert(1, years[0])
years.insert(6, years[5])

In [21]:
# Now they are all the same length
print("Years:   %d" % (len(years)))
print("Actors:  %d" % (len(actors)))
print("Films:   %d" % (len(films)))

Years:   94
Actors:  94
Films:   94

In [22]:
df_actors = pd.DataFrame()
df_actors["Year"] = pd.to_numeric(years, errors='coerce')
df_actors["Actor"] = actors
df_actors["Film"] = films

In [23]:
# See the years 1928 and 1932 have two winners
df_actors.head(7)

   Year             Actor                     Film
0  1928     Emil Jannings         The Last Command
1  1928     Emil Jannings     The Way of All Flesh
2  1929     Warner Baxter           In Old Arizona
3  1930     George Arliss                 Disraeli
4  1931  Lionel Barrymore              A Free Soul
5  1932     Wallace Beery                The Champ
6  1932     Fredric March  Dr. Jekyll and Mr. Hyde

In [24]:
df_actors.tail()

    Year              Actor                   Film
89  2015  Leonardo DiCaprio           The Revenant
90  2016      Casey Affleck  Manchester by the Sea
91  2017        Gary Oldman           Darkest Hour
92  2018         Rami Malek      Bohemian Rhapsody
93  2019    Joaquin Phoenix                  Joker

In [25]:
# Page 4- Best Actress
data = loadPage("https://en.wikipedia.org/wiki/Academy_Award_for_Best_Actress")
tables = data.findAll("table", class_= "wikitable sortable")

In [26]:
data = extractFilmData("actress", tables)
films = data["films"]
actresses = data["names"]
years = extractYears("actress", tables)

In [27]:
# Check the length of each list. 
# They are not the same. There are two reasons for this.
# 1. In the 1st Oscars the actress won awards for three films
# 2. In 1968 there was a tie for 1st place
print("Years:       %d" % (len(years)))
print("Actressess:  %d" % (len(actresses)))
print("Films:       %d" % (len(films)))

Years:       92
Actressess:  93
Films:       95

In [28]:
# Lets amend this by inserting the actress at the position 0 to positions 1 and 2. Do the same for the years
# Also insert the year at position 40 into position 41
actresses.insert(1, actresses[0])
actresses.insert(2, actresses[1])
years.insert(41, years[40])
years.insert(1, years[0])
years.insert(2, years[1])

In [29]:
# Now they are all the same length
print("Years:       %d" % (len(years)))
print("Actressess:  %d" % (len(actresses)))
print("Films:       %d" % (len(films)))

Years:       95
Actressess:  95
Films:       95

In [30]:
df_actresses = pd.DataFrame()
df_actresses["Year"] = pd.to_numeric(years, errors='coerce')
df_actresses["Actress"] = actresses
df_actresses["Film"] = films

In [31]:
# See the first three rows which have the same year and actress but different films
df_actresses.head()

   Year        Actress                           Film
0  1928   Janet Gaynor                     7th Heaven
1  1928   Janet Gaynor                   Street Angel
2  1928   Janet Gaynor  Sunrise: A Song of Two Humans
3  1929  Mary Pickford                       Coquette
4  1930  Norma Shearer                   The Divorcee

In [32]:
df_actresses.tail()

    Year            Actress                                       Film
90  2015        Brie Larson                                       Room
91  2016         Emma Stone                                 La La Land
92  2017  Frances McDormand  Three Billboards Outside Ebbing, Missouri
93  2018      Olivia Colman                              The Favourite
94  2019    Renée Zellweger                                       Judy

In [33]:
# Now check the year 1968 and see two actresses and two films
df_actresses.loc[df_actresses['Year'] == 1968]

    Year            Actress                Film
42  1968  Katharine Hepburn  The Lion in Winter
43  1968   Barbra Streisand          Funny Girl

In [34]:
# Page 5 - Best Supporting Actor
data = loadPage("https://en.wikipedia.org/wiki/Academy_Award_for_Best_Supporting_Actor")
tables = data.findAll("table", class_= "wikitable sortable")

In [35]:
data = extractFilmData("supporting actor", tables)
films = data["films"]
actors = data["names"]
years = extractYears("supporting actor", tables)

In [36]:
# Check all lists are the same length, they are
print("Years:   %d" % (len(years)))
print("Actors:  %d" % (len(actors)))
print("Films:   %d" % (len(films)))

Years:   84
Actors:  84
Films:   84

In [37]:
df_supActors = pd.DataFrame()
df_supActors["Year"] = pd.to_numeric(years, errors='coerce')
df_supActors["Actor"] = actors
df_supActors["Film"] = films

In [38]:
df_supActors.head()

   Year               Actor                    Film
0  1936      Walter Brennan         Come and Get It
1  1937  Joseph Schildkraut  The Life of Emile Zola
2  1938      Walter Brennan                Kentucky
3  1939     Thomas Mitchell              Stagecoach
4  1940      Walter Brennan           The Westerner

In [39]:
df_supActors.tail()

    Year           Actor                                       Film
79  2015    Mark Rylance                            Bridge of Spies
80  2016  Mahershala Ali                                  Moonlight
81  2017    Sam Rockwell  Three Billboards Outside Ebbing, Missouri
82  2018  Mahershala Ali                                 Green Book
83  2019       Brad Pitt              Once Upon a Time in Hollywood

In [40]:
# Page 6 - Best Supporting Actress
data = loadPage("https://en.wikipedia.org/wiki/Academy_Award_for_Best_Supporting_Actress")
tables = data.findAll("table", class_= "wikitable sortable")

In [41]:
data = extractFilmData("supporting actress", tables)
films = data["films"]
actresses = data["names"]
years = extractYears("supporting actress", tables)

In [42]:
# Check all the lists are the same length, they are
print("Years:      %d" % (len(years)))
print("Actresses:  %d" % (len(actresses)))
print("Films:      %d" % (len(films)))

Years:      84
Actresses:  84
Films:      84

In [43]:
df_supActresses = pd.DataFrame()
df_supActresses["Year"] = pd.to_numeric(years, errors='coerce')
df_supActresses["Actress"] = actresses
df_supActresses["Film"] = films

In [44]:
df_supActresses.head()

   Year           Actress                 Film
0  1936  Gale Sondergaard      Anthony Adverse
1  1937       Alice Brady       In Old Chicago
2  1938       Fay Bainter              Jezebel
3  1939   Hattie McDaniel   Gone with the Wind
4  1940      Jane Darwell  The Grapes of Wrath

In [45]:
df_supActresses.tail()

    Year          Actress                        Film
79  2015  Alicia Vikander             The Danish Girl
80  2016      Viola Davis                      Fences
81  2017   Allison Janney                    I, Tonya
82  2018      Regina King  If Beale Street Could Talk
83  2019       Laura Dern              Marriage Story

In [46]:
# Print the number of rows in each data frame
print("Total best picture winners:             %s" % (df_picture.shape[0]))
print("Total best director winners:            %s" % (df_directors.shape[0]))
print("Total best actor winners:               %s" % (df_actors.shape[0]))
print("Total best actress winners:             %s" % (df_actresses.shape[0]))
print("Total best supporting actor winners:    %s" % (df_supActors.shape[0]))
print("Total best supporting actress winners:  %s" % (df_supActresses.shape[0]))

Total best picture winners:             92
Total best director winners:            93
Total best actor winners:               94
Total best actress winners:             95
Total best supporting actor winners:    84
Total best supporting actress winners:  84

In [47]:
# Now all the data has been read into data frames, the next step is to connect to MYSQL and store it in the database
from sqlalchemy import create_engine    # For connecting to MySQL
from MySQL_connect import config        # Import connection parameters from file

# Use the parameters to create connection variables
user = config['user']
password = config['password']
host = config['host']
db = config['db']

# Connection object for MySQL
engine = create_engine("mysql+mysqldb://"+user+":"+password+"@"+host+"/"+db+"?charset=utf8")

In [48]:
# Create table winner_best_picture and add data to it
# Check if table already exists, if it does then delete it
if(engine.execute("SHOW TABLES LIKE 'winner_best_picture'").fetchone()):
    engine.execute("DROP TABLE winner_best_picture")

# Create table by defining its structure and column data types
# Character set utf8 is used to prevent errors caused by non ascii characters
engine.execute("CREATE TABLE winner_best_picture ( \
               Id INT NOT NULL AUTO_INCREMENT, \
               Year INT, \
               Film CHAR(255) CHARACTER SET UTF8, \
               Producers CHAR(255) CHARACTER SET UTF8, \
               PRIMARY KEY(Id) )")

# Loop through each row of the dataframe and add it to the table
for index, row in df_picture.iterrows():
    engine.execute("INSERT INTO winner_best_picture (Year, Film, Producers) \
    VALUES(%s, %s, %s)", (row[0], row[1], row[2]))

In [49]:
# Create table winner_best_director and add data to it

if(engine.execute("SHOW TABLES LIKE 'winner_best_director'").fetchone()):
    engine.execute("DROP TABLE winner_best_director")

engine.execute("CREATE TABLE winner_best_director ( \
               Id INT NOT NULL AUTO_INCREMENT, \
               Year INT, \
               Director CHAR(255) CHARACTER SET UTF8, \
               Film CHAR(255) CHARACTER SET UTF8, \
               PRIMARY KEY(Id) )")

for index, row in df_directors.iterrows():
    engine.execute("INSERT INTO winner_best_director (Year, Director, Film) \
    VALUES(%s, %s, %s)", (row[0], row[1], row[2]))

In [50]:
# Create table winner_best_actor and add data to it

if(engine.execute("SHOW TABLES LIKE 'winner_best_actor'").fetchone()):
    engine.execute("DROP TABLE winner_best_actor")

engine.execute("CREATE TABLE winner_best_actor ( \
               Id INT NOT NULL AUTO_INCREMENT, \
               Year INT, \
               Actor CHAR(255) CHARACTER SET UTF8, \
               Film CHAR(255) CHARACTER SET UTF8, \
               PRIMARY KEY(Id) )")

for index, row in df_actors.iterrows():
    engine.execute("INSERT INTO winner_best_actor (Year, Actor, Film) \
    VALUES(%s, %s, %s)", (row[0], row[1], row[2]))

In [51]:
# Create table winner_best_actress and add data to it

if(engine.execute("SHOW TABLES LIKE 'winner_best_actress'").fetchone()):
    engine.execute("DROP TABLE winner_best_actress")

engine.execute("CREATE TABLE winner_best_actress ( \
               Id INT NOT NULL AUTO_INCREMENT, \
               Year INT, \
               Actress CHAR(255) CHARACTER SET UTF8, \
               Film CHAR(255) CHARACTER SET UTF8, \
               PRIMARY KEY(Id) )")

for index, row in df_actresses.iterrows():
    engine.execute("INSERT INTO winner_best_actress (Year, Actress, Film) \
    VALUES(%s, %s, %s)", (row[0], row[1], row[2]))

In [52]:
# Create table winner_best_supporting_actor and add data to it

if(engine.execute("SHOW TABLES LIKE 'winner_best_supporting_actor'").fetchone()):
    engine.execute("DROP TABLE winner_best_supporting_actor")

engine.execute("CREATE TABLE winner_best_supporting_actor ( \
               Id INT NOT NULL AUTO_INCREMENT, \
               Year INT, \
               Actor CHAR(255) CHARACTER SET UTF8, \
               Film CHAR(255) CHARACTER SET UTF8, \
               PRIMARY KEY(Id) )")

for index, row in df_supActors.iterrows():
    engine.execute("INSERT INTO winner_best_supporting_actor (Year, Actor, Film) \
    VALUES(%s, %s, %s)", (row[0], row[1], row[2]))

In [53]:
# Create table winner_best_supporting_actress and add data to it

if(engine.execute("SHOW TABLES LIKE 'winner_best_supporting_actress'").fetchone()):
    engine.execute("DROP TABLE winner_best_supporting_actress")

engine.execute("CREATE TABLE winner_best_supporting_actress ( \
               Id INT NOT NULL AUTO_INCREMENT, \
               Year INT, \
               Actress CHAR(255) CHARACTER SET UTF8, \
               Film CHAR(255) CHARACTER SET UTF8, \
               PRIMARY KEY(Id) )")

for index, row in df_supActresses.iterrows():
    engine.execute("INSERT INTO winner_best_supporting_actress (Year, Actress, Film) \
    VALUES(%s, %s, %s)", (row[0], row[1], row[2]))

In [54]:
# Now lets run some queries on the tables
# First return the number of rows in each table
num_res = engine.execute("SELECT COUNT(*) FROM winner_best_picture")
print("Winner Best Picture number of rows:            %s" % (num_res.scalar()))

num_res = engine.execute("SELECT COUNT(*) FROM winner_best_director")
print("Winner Best Director number of rows:           %s" % (num_res.scalar()))

num_res = engine.execute("SELECT COUNT(*) FROM winner_best_actor")
print("Winner Best Actor number of rows:              %s" % (num_res.scalar()))

num_res = engine.execute("SELECT COUNT(*) FROM winner_best_actress")
print("Winner Best Actress number of rows:            %s" % (num_res.scalar()))

num_res = engine.execute("SELECT COUNT(*) FROM winner_best_supporting_actor")
print("Winner Best Supporting Actor number of rows:   %s" % (num_res.scalar()))

num_res = engine.execute("SELECT COUNT(*) FROM winner_best_supporting_actress")
print("Winner Best Supporting Actress number of rows: %s" % (num_res.scalar()))

Winner Best Picture number of rows:            92
Winner Best Director number of rows:           93
Winner Best Actor number of rows:              94
Winner Best Actress number of rows:            95
Winner Best Supporting Actor number of rows:   84
Winner Best Supporting Actress number of rows: 84

In [55]:
# For displaying results in a table format
from prettytable import PrettyTable

In [56]:
# Query: Return a list of actors who have won an Oscar. In descending order of wins
# Explained: We are using two tables - best_actor and best_supporting_actor. 
# Therefore we use UNION inside a subquery to combine the results of two queries into one set. 
# Each query counts the total for each actor so we sum both totals to get the total number of wins for each actor.
actor_mostWins = engine.execute("\
SELECT actor, SUM(total_wins) AS total_wins \
FROM ( \
    SELECT actor, \
           COUNT(actor) AS total_wins \
    FROM winner_best_actor \
    GROUP BY actor \
    UNION \
    SELECT actor, \
           COUNT(actor) AS total_wins \
    FROM winner_best_supporting_actor \
    GROUP BY actor \
) AS res \
GROUP BY actor \
ORDER BY total_wins DESC, actor ASC")

table = PrettyTable(['Actor', 'Wins'])
for row in actor_mostWins:
    table.add_row([row['actor'], row['total_wins']])
print(table)

+------------------------+------+
|         Actor          | Wins |
+------------------------+------+
|    Daniel Day-Lewis    |  3   |
|     Jack Nicholson     |  3   |
|     Walter Brennan     |  3   |
|     Anthony Quinn      |  2   |
|    Christoph Waltz     |  2   |
|     Dustin Hoffman     |  2   |
|     Emil Jannings      |  2   |
|     Fredric March      |  2   |
|      Gary Cooper       |  2   |
|     Jason Robards      |  2   |
|     Mahershala Ali     |  2   |
|     Marlon Brando      |  2   |
|     Melvyn Douglas     |  2   |
|     Michael Caine      |  2   |
|     Peter Ustinov      |  2   |
|       Sean Penn        |  2   |
|     Spencer Tracy      |  2   |
|       Tom Hanks        |  2   |
|      Adrien Brody      |  1   |
|       Al Pacino        |  1   |
|       Alan Arkin       |  1   |
|     Alec Guinness      |  1   |
|    Anthony Hopkins     |  1   |
|       Art Carney       |  1   |
|    Barry Fitzgerald    |  1   |
|      Ben Johnson       |  1   |
|      Ben Kingsley      |  1   |
|    Benicio del Toro    |  1   |
|      Bing Crosby       |  1   |
|       Brad Pitt        |  1   |
|   Broderick Crawford   |  1   |
|       Burl Ives        |  1   |
|     Burt Lancaster     |  1   |
|     Casey Affleck      |  1   |
|     Charles Coburn     |  1   |
|    Charles Laughton    |  1   |
|    Charlton Heston     |  1   |
|      Chris Cooper      |  1   |
|     Christian Bale     |  1   |
|  Christopher Plummer   |  1   |
|   Christopher Walken   |  1   |
|      Clark Gable       |  1   |
|    Cliff Robertson     |  1   |
|      Colin Firth       |  1   |
|    Cuba Gooding Jr.    |  1   |
|      David Niven       |  1   |
|      Dean Jagger       |  1   |
|   Denzel Washington    |  1   |
|       Don Ameche       |  1   |
|      Donald Crisp      |  1   |
|       Ed Begley        |  1   |
|     Eddie Redmayne     |  1   |
|     Edmond O'Brien     |  1   |
|      Edmund Gwenn      |  1   |
|    Ernest Borgnine     |  1   |
|   F. Murray Abraham    |  1   |
|    Forest Whitaker     |  1   |
|     Frank Sinatra      |  1   |
|      Gary Oldman       |  1   |
|      Gene Hackman      |  1   |
|     Geoffrey Rush      |  1   |
|     George Arliss      |  1   |
|      George Burns      |  1   |
|    George C. Scott     |  1   |
|    George Chakiris     |  1   |
|     George Clooney     |  1   |
|     George Kennedy     |  1   |
|     George Sanders     |  1   |
|       Gig Young        |  1   |
|      Gregory Peck      |  1   |
|     Haing S. Ngor      |  1   |
|     Harold Russell     |  1   |
|      Heath Ledger      |  1   |
|      Henry Fonda       |  1   |
|     Hugh Griffith      |  1   |
|    Humphrey Bogart     |  1   |
|     J. K. Simmons      |  1   |
|     Jack Albertson     |  1   |
|      Jack Lemmon       |  1   |
|      Jack Palance      |  1   |
|      James Cagney      |  1   |
|      James Coburn      |  1   |
|       James Dunn       |  1   |
|     James Stewart      |  1   |
|       Jamie Foxx       |  1   |
|       Jared Leto       |  1   |
|     Javier Bardem      |  1   |
|     Jean Dujardin      |  1   |
|      Jeff Bridges      |  1   |
|      Jeremy Irons      |  1   |
|     Jim Broadbent      |  1   |
|    Joaquin Phoenix     |  1   |
|       Joe Pesci        |  1   |
|       Joel Grey        |  1   |
|      John Gielgud      |  1   |
|     John Houseman      |  1   |
|       John Mills       |  1   |
|       John Wayne       |  1   |
|       Jon Voight       |  1   |
|      José Ferrer       |  1   |
|   Joseph Schildkraut   |  1   |
|      Karl Malden       |  1   |
|      Kevin Kline       |  1   |
|      Kevin Spacey      |  1   |
|    Laurence Olivier    |  1   |
|       Lee Marvin       |  1   |
|   Leonardo DiCaprio    |  1   |
|    Lionel Barrymore    |  1   |
|   Louis Gossett Jr.    |  1   |
|      Mark Rylance      |  1   |
|     Martin Balsam      |  1   |
|     Martin Landau      |  1   |
|  Matthew McConaughey   |  1   |
|   Maximilian Schell    |  1   |
|    Michael Douglas     |  1   |
|     Morgan Freeman     |  1   |
|      Nicolas Cage      |  1   |
|       Paul Lukas       |  1   |
|       Paul Muni        |  1   |
|      Paul Newman       |  1   |
|     Paul Scofield      |  1   |
|      Peter Finch       |  1   |
| Philip Seymour Hoffman |  1   |
|       Rami Malek       |  1   |
|      Ray Milland       |  1   |
|      Red Buttons       |  1   |
|      Rex Harrison      |  1   |
|    Richard Dreyfuss    |  1   |
|     Robert De Niro     |  1   |
|      Robert Donat      |  1   |
|     Robert Duvall      |  1   |
|    Roberto Benigni     |  1   |
|     Robin Williams     |  1   |
|      Rod Steiger       |  1   |
|     Ronald Colman      |  1   |
|     Russell Crowe      |  1   |
|      Sam Rockwell      |  1   |
|      Sean Connery      |  1   |
|     Sidney Poitier     |  1   |
|    Thomas Mitchell     |  1   |
|      Tim Robbins       |  1   |
|     Timothy Hutton     |  1   |
|    Tommy Lee Jones     |  1   |
|       Van Heflin       |  1   |
|    Victor McLaglen     |  1   |
|     Wallace Beery      |  1   |
|     Walter Huston      |  1   |
|     Walter Matthau     |  1   |
|     Warner Baxter      |  1   |
|     William Holden     |  1   |
|      William Hurt      |  1   |
|      Yul Brynner       |  1   |
+------------------------+------+

In [57]:
# Query: Return a list of actresses who have won an Oscar. In descending order of wins
# Explained: We are using two tables - best_actress and best_supporting_actress. 
# Therefore we use UNION inside a subquery to combine the results of two queries into one set. 
# Each query counts the total for each actress so we sum both totals to get the total number of wins for each actress.
actress_mostWins = engine.execute("\
SELECT actress, SUM(total_wins) AS total_wins \
FROM( \
    SELECT actress, \
           COUNT(actress) AS total_wins \
    FROM winner_best_actress \
    GROUP BY actress \
    UNION SELECT actress, \
          COUNT(actress) AS total_wins \
    FROM winner_best_supporting_actress \
    GROUP BY actress \
) AS res \
GROUP BY actress \
ORDER BY total_wins DESC, actress ASC")

table = PrettyTable(['Actress', 'Wins'])
for row in actress_mostWins:
    table.add_row([row['actress'], row['total_wins']])
print(table)

+----------------------+------+
|       Actress        | Wins |
+----------------------+------+
|  Katharine Hepburn   |  4   |
|    Ingrid Bergman    |  3   |
|     Janet Gaynor     |  3   |
|     Meryl Streep     |  3   |
|     Bette Davis      |  2   |
|     Dianne Wiest     |  2   |
|   Elizabeth Taylor   |  2   |
|  Frances McDormand   |  2   |
|    Glenda Jackson    |  2   |
|     Hilary Swank     |  2   |
|      Jane Fonda      |  2   |
|     Jodie Foster     |  2   |
|     Luise Rainer     |  2   |
| Olivia de Havilland  |  2   |
|     Sally Field      |  2   |
|   Shelley Winters    |  2   |
|     Vivien Leigh     |  2   |
|     Alice Brady      |  1   |
|   Alicia Vikander    |  1   |
|    Allison Janney    |  1   |
|    Angelina Jolie    |  1   |
|   Anjelica Huston    |  1   |
|     Anna Magnani     |  1   |
|     Anna Paquin      |  1   |
|    Anne Bancroft     |  1   |
|     Anne Baxter      |  1   |
|    Anne Hathaway     |  1   |
|     Anne Revere      |  1   |
|    Audrey Hepburn    |  1   |
|   Barbra Streisand   |  1   |
|  Beatrice Straight   |  1   |
|    Brenda Fricker    |  1   |
|     Brie Larson      |  1   |
|    Cate Blanchett    |  1   |
| Catherine Zeta-Jones |  1   |
|     Celeste Holm     |  1   |
|   Charlize Theron    |  1   |
|         Cher         |  1   |
|    Claire Trevor     |  1   |
|  Claudette Colbert   |  1   |
|   Cloris Leachman    |  1   |
|     Diane Keaton     |  1   |
|      Donna Reed      |  1   |
|    Dorothy Malone    |  1   |
|    Eileen Heckart    |  1   |
|    Ellen Burstyn     |  1   |
|      Emma Stone      |  1   |
|    Emma Thompson     |  1   |
|   Estelle Parsons    |  1   |
|   Ethel Barrymore    |  1   |
|   Eva Marie Saint    |  1   |
|     Fay Bainter      |  1   |
|     Faye Dunaway     |  1   |
|   Gale Sondergaard   |  1   |
|     Geena Davis      |  1   |
|    Geraldine Page    |  1   |
|    Ginger Rogers     |  1   |
|    Gloria Grahame    |  1   |
|     Goldie Hawn      |  1   |
|     Grace Kelly      |  1   |
|     Greer Garson     |  1   |
|   Gwyneth Paltrow    |  1   |
|     Halle Berry      |  1   |
|   Hattie McDaniel    |  1   |
|     Helen Hayes      |  1   |
|      Helen Hunt      |  1   |
|     Helen Mirren     |  1   |
|     Holly Hunter     |  1   |
|     Jane Darwell     |  1   |
|      Jane Wyman      |  1   |
|  Jennifer Connelly   |  1   |
|   Jennifer Hudson    |  1   |
|    Jennifer Jones    |  1   |
|  Jennifer Lawrence   |  1   |
|    Jessica Lange     |  1   |
|    Jessica Tandy     |  1   |
|     Jo Van Fleet     |  1   |
|    Joan Crawford     |  1   |
|    Joan Fontaine     |  1   |
|   Joanne Woodward    |  1   |
|    Josephine Hull    |  1   |
|      Judi Dench      |  1   |
|    Judy Holliday     |  1   |
|    Julia Roberts     |  1   |
|    Julianne Moore    |  1   |
|    Julie Andrews     |  1   |
|    Julie Christie    |  1   |
|   Juliette Binoche   |  1   |
|     Kate Winslet     |  1   |
|     Kathy Bates      |  1   |
|    Katina Paxinou    |  1   |
|     Kim Basinger     |  1   |
|      Kim Hunter      |  1   |
|      Laura Dern      |  1   |
|      Lee Grant       |  1   |
|     Lila Kedrova     |  1   |
|      Linda Hunt      |  1   |
|    Liza Minnelli     |  1   |
|    Loretta Young     |  1   |
|   Louise Fletcher    |  1   |
|    Lupita Nyong'o    |  1   |
|     Maggie Smith     |  1   |
|  Marcia Gay Harden   |  1   |
| Margaret Rutherford  |  1   |
|    Marie Dressler    |  1   |
|   Marion Cotillard   |  1   |
|     Marisa Tomei     |  1   |
|    Marlee Matlin     |  1   |
|      Mary Astor      |  1   |
|    Mary Pickford     |  1   |
|   Mary Steenburgen   |  1   |
|  Maureen Stapleton   |  1   |
|     Melissa Leo      |  1   |
| Mercedes McCambridge |  1   |
|    Mercedes Ruehl    |  1   |
|     Mira Sorvino     |  1   |
|    Miyoshi Umeki     |  1   |
|       Mo'Nique       |  1   |
|   Natalie Portman    |  1   |
|    Nicole Kidman     |  1   |
|    Norma Shearer     |  1   |
|   Octavia Spencer    |  1   |
|    Olivia Colman     |  1   |
|   Olympia Dukakis    |  1   |
|  Patricia Arquette   |  1   |
|    Patricia Neal     |  1   |
|      Patty Duke      |  1   |
|    Peggy Ashcroft    |  1   |
|    Penélope Cruz     |  1   |
|     Rachel Weisz     |  1   |
|  Reese Witherspoon   |  1   |
|     Regina King      |  1   |
|   Renée Zellweger    |  1   |
|     Rita Moreno      |  1   |
|     Ruth Gordon      |  1   |
|    Sandra Bullock    |  1   |
|     Sandy Dennis     |  1   |
|    Shirley Booth     |  1   |
|    Shirley Jones     |  1   |
|   Shirley MacLaine   |  1   |
|   Simone Signoret    |  1   |
|     Sissy Spacek     |  1   |
|     Sophia Loren     |  1   |
|    Susan Hayward     |  1   |
|    Susan Sarandon    |  1   |
|     Tatum O'Neal     |  1   |
|    Teresa Wright     |  1   |
|    Tilda Swinton     |  1   |
|   Vanessa Redgrave   |  1   |
|     Viola Davis      |  1   |
|     Wendy Hiller     |  1   |
|   Whoopi Goldberg    |  1   |
+----------------------+------+

In [58]:
# Query: Return a list of directors who have won an Oscar. In descending order of wins
# Explained: Because the 1st Osars had winners in different categories we have to use 
# substring to get rid of any brackets at the end of any names. 
# With the names correct we can now get the total for each director
director_mostWins = engine.execute("\
SELECT director, SUM(num_wins) AS total_wins \
FROM( \
    SELECT IF(SUBSTRING(director, LENGTH(director)) = ')', \
              SUBSTRING(director, 1, POSITION('(' IN director) -1), \
              director \
           ) AS director, \
    COUNT(IF(SUBSTRING(director, LENGTH(director)) = ')', \
             SUBSTRING(director, 1, POSITION('(' IN director) -1), \
             director) \
         ) AS num_wins \
    FROM winner_best_director \
    GROUP BY director \
) AS res \
GROUP BY director \
ORDER BY total_wins DESC, director ASC");

table = PrettyTable(['Director', 'Wins'])
for row in director_mostWins:
    table.add_row([row['director'], row['total_wins']])
print(table)

+------------------------------+------+
|           Director           | Wins |
+------------------------------+------+
|          John Ford           |  4   |
|         Frank Capra          |  3   |
|        William Wyler         |  3   |
|    Alejandro G. Iñárritu     |  2   |
|        Alfonso Cuarón        |  2   |
|           Ang Lee            |  2   |
|         Billy Wilder         |  2   |
|        Clint Eastwood        |  2   |
|          David Lean          |  2   |
|          Elia Kazan          |  2   |
|        Frank Borzage         |  2   |
|         Frank Lloyd          |  2   |
|        Fred Zinnemann        |  2   |
|        George Stevens        |  2   |
|     Joseph L. Mankiewicz     |  2   |
|         Leo McCarey          |  2   |
|       Lewis Milestone        |  2   |
|         Miloš Forman         |  2   |
|         Oliver Stone         |  2   |
|       Steven Spielberg       |  2   |
|      Anthony Minghella       |  1   |
|        Barry Levinson        |  1   |
|     Bernardo Bertolucci      |  1   |
|          Bob Fosse           |  1   |
|         Bong Joon-ho         |  1   |
|          Carol Reed          |  1   |
|        Coen Brothers         |  1   |
|       Damien Chazelle        |  1   |
|         Danny Boyle          |  1   |
|         Delbert Mann         |  1   |
|     Francis Ford Coppola     |  1   |
|    Franklin J. Schaffner     |  1   |
|         George Cukor         |  1   |
|       George Roy Hill        |  1   |
|      Guillermo del Toro      |  1   |
|        James Cameron         |  1   |
|       James L. Brooks        |  1   |
|       John G. Avildsen       |  1   |
|         John Huston          |  1   |
|       John Schlesinger       |  1   |
|        Jonathan Demme        |  1   |
|       Kathryn Bigelow        |  1   |
|        Kevin Costner         |  1   |
|       Martin Scorsese        |  1   |
|          Mel Gibson          |  1   |
|        Michael Cimino        |  1   |
|        Michael Curtiz        |  1   |
|     Michel Hazanavicius      |  1   |
|         Mike Nichols         |  1   |
|        Norman Taurog         |  1   |
|        Peter Jackson         |  1   |
|     Richard Attenborough     |  1   |
|        Robert Benton         |  1   |
|        Robert Redford        |  1   |
|         Robert Wise          |  1   |
| Robert Wise & Jerome Robbins |  1   |
|       Robert Zemeckis        |  1   |
|        Roman Polanski        |  1   |
|          Ron Howard          |  1   |
|          Sam Mendes          |  1   |
|      Steven Soderbergh       |  1   |
|        Sydney Pollack        |  1   |
|          Tom Hooper          |  1   |
|       Tony Richardson        |  1   |
|        Victor Fleming        |  1   |
|      Vincente Minnelli       |  1   |
|        Warren Beatty         |  1   |
|       William Friedkin       |  1   |
|         Woody Allen          |  1   |
+------------------------------+------+

In [59]:
# Query: Return a list of best picture winning producers in descending order of total wins
# Explained: This query is difficult because the producers column can have multiple names in it. 
# We are interested in the first name as that is usually the director. 
# The names can be seperated by either commas or 'and' so we use search for the position of the first comma. 
# If a comma is found then use that as the maximum index for the substring. 
# If not then search for the position of ' and ' and use that as the maximum index. 
# Finally return the substring and use it for the count.
picture_mostWins = engine.execute("\
SELECT IF(POSITION(',' IN producers) > 0, \
          SUBSTRING(producers, 1, POSITION(',' IN producers) -1) , \
          IF(POSITION(' and ' IN producers) > 0, \
              SUBSTRING(producers, 1, POSITION(' and ' IN producers)), \
              producers) \
) AS name, COUNT(producers) AS total_wins \
FROM winner_best_picture \
GROUP BY name \
ORDER BY total_wins DESC, name ASC")

table = PrettyTable(['Producer', 'Wins'])
for row in picture_mostWins:
    table.add_row([row['name'], row['total_wins']])
print(table)

+---------------------------------+------+
|             Producer            | Wins |
+---------------------------------+------+
|       Metro-Goldwyn-Mayer       |  5   |
|         20th Century-Fox        |  3   |
|             Columbia            |  3   |
|           Sam Spiegel           |  3   |
|           Arthur Freed          |  2   |
|          Clint Eastwood         |  2   |
|            Paramount            |  2   |
|           Robert Wise           |  2   |
|           Saul Zaentz           |  2   |
| Selznick International Pictures |  2   |
|           Warner Bros.          |  2   |
|          Adele Romanski         |  1   |
|         Albert S. Ruddy         |  1   |
|      Alejandro G. Iñárritu      |  1   |
|         Arnold Kopelson         |  1   |
|        Barrie M. Osborne        |  1   |
|          Barry Spikings         |  1   |
|           Billy Wilder          |  1   |
|         Blye Pagon Faust        |  1   |
|            Brad Pitt            |  1   |
|          Brian Grazer           |  1   |
|           Bruce Cohen           |  1   |
|           Buddy Adler           |  1   |
|         Cecil B. DeMille        |  1   |
|         Charles H. Joffe        |  1   |
|         Christian Colson        |  1   |
|          David Parfitt          |  1   |
|          David Puttnam          |  1   |
|           Douglas Wick          |  1   |
|           Edward Saxon          |  1   |
|               Fox               |  1   |
|       Francis Ford Coppola      |  1   |
|          Frank McCarthy         |  1   |
|          Fred Zinnemann         |  1   |
|           Graham King           |  1   |
|           Grant Heslov          |  1   |
|       Guillermo del Toro        |  1   |
|           Harold Hecht          |  1   |
|           Iain Canning          |  1   |
|          Irwin Winkler          |  1   |
| J. Arthur Rank-Two Cities Films |  1   |
|          Jack L. Warner         |  1   |
|          James Cameron          |  1   |
|         James L. Brooks         |  1   |
|          Jeremy Thomas          |  1   |
|          Jerome Hellman         |  1   |
|            Jim Burke            |  1   |
|           Jim Wilson            |  1   |
|            John Woolf           |  1   |
|         Kathryn Bigelow         |  1   |
|           Kwak Sin-ae           |  1   |
|           Mark Johnson          |  1   |
|         Martin Richards         |  1   |
|            Mel Gibson           |  1   |
|         Michael Douglas         |  1   |
|           Michael Todd          |  1   |
|      Paramount Famous Lasky     |  1   |
|           Paul Haggis           |  1   |
|         Philip D'Antoni         |  1   |
|       Richard Attenborough      |  1   |
|        Richard D. Zanuck        |  1   |
|            RKO Radio            |  1   |
|        Ronald L. Schwary        |  1   |
|          Sam Zimbalist          |  1   |
|    Samuel Goldwyn Productions   |  1   |
|           Scott Rudin           |  1   |
|         Stanley R. Jaffe        |  1   |
|         Steven Spielberg        |  1   |
|          Sydney Pollack         |  1   |
|         Thomas Langmann         |  1   |
|            Tony Bill            |  1   |
|         Tony Richardson         |  1   |
|            Universal            |  1   |
|          Walter Mirisch         |  1   |
|          Wendy Finerman         |  1   |
+---------------------------------+------+